In [2]:
import pandas as pd

Leetcode595

In [3]:
def big_countries(world: pd.DataFrame) -> pd.DataFrame:
    return world[(world['area'] > 3000000) | (world['population'] >= 25000000)][['name','area','population']]

In [4]:
data = {
    'name': ['Afghanistan', 'Albania', 'Algeria', 'Andorra', 'Angola'],
    'continent': ['Asia', 'Europe', 'Africa', 'Europe', 'Africa'],
    'area': [652230, 28748, 2381741, 468, 1246700],
    'population': [25500100, 2831741, 37100000, 78115, 20609294],
    'gdp': [20343000000, 12960000000, 188681000000, 3712000000, 100990000000]
}

df = pd.DataFrame(data)

df

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [5]:
big_countries(df)

          name     area  population
0  Afghanistan   652230    25500100
2      Algeria  2381741    37100000

Leetcode1757

In [6]:
data = {
    'product_id': [0, 1, 2, 3, 4],
    'low_fats': ['Y', 'Y', 'N', 'Y', 'N'],
    'recyclable': ['N', 'Y', 'Y', 'Y', 'N']
}

df = pd.DataFrame(data)
print(df)

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [7]:
def find_products(products: pd.DataFrame) -> pd.DataFrame:
    df = products[(products['low_fats'] == 'Y') & (products['recyclable'] == 'Y')][['product_id']]
    return df

In [8]:
find_products(df)

   product_id
1           1
3           3

leetcode 183. Customers Who Never Order

In [9]:
# Create Customers and Orders data
customers_data = {'id': [1, 2, 3, 4], 'name': ['Joe', 'Henry', 'Sam', 'Max']}
orders_data = {'id': [1, 2], 'customerId': [3, 1]}

# Create dataframes
customers_df = pd.DataFrame(customers_data)
orders_df = pd.DataFrame(orders_data)

In [10]:
def find_customers(customers: pd.DataFrame, orders: pd.DataFrame) -> pd.DataFrame:
    df = pd.merge(orders, customers, left_on='customerId', right_on='id', how='outer')
    df.rename(columns={'name': 'Customers'}, inplace=True)
    df = df[df['customerId'].isnull()]
    df.drop(columns=['customerId', 'id_x', 'id_y'], inplace=True)
    return df

1148. Article Views I

In [11]:
data = {
    'article_id': [1, 1, 2, 2, 4, 3, 3],
    'author_id': [3, 3, 7, 7, 7, 4, 4],
    'viewer_id': [5, 6, 7, 6, 1, 4, 4],
    'view_date': ['2019-08-01', '2019-08-02', '2019-08-01', '2019-08-02', '2019-07-22', '2019-07-21', '2019-07-21']
}

df = pd.DataFrame(data)
df

   article_id  author_id  viewer_id   view_date
0           1          3          5  2019-08-01
1           1          3          6  2019-08-02
2           2          7          7  2019-08-01
3           2          7          6  2019-08-02
4           4          7          1  2019-07-22
5           3          4          4  2019-07-21
6           3          4          4  2019-07-21

In [12]:
def article_views(views: pd.DataFrame) -> pd.DataFrame:
    df = views['author_id'][views['author_id'] == views['viewer_id']].drop_duplicates().reset_index(drop=True)
    new_data = pd.DataFrame(df, dtype='int64')
    new_data.rename(columns={'author_id' : 'id'}, inplace=True)
    new_data.sort_values(by='id', ascending=True, inplace=True)
    return new_data
article_views(df)

   id
1   4
0   7

1683. Invalid Tweets

In [13]:
data = {
    'tweet_id': [1, 2],
    'content': ['Vote for Biden', 'Let us make America great again!']
}

df = pd.DataFrame(data)

In [14]:
def invalid_tweets(tweets: pd.DataFrame) -> pd.DataFrame:
    df = tweets[tweets['content'].str.len() > 15]
    df = df.drop(columns='content')
    return df

invalid_tweets(df)

   tweet_id
1         2

1873. Calculate Special Bonus

In [15]:

data = {
    'employee_id': [2, 3, 7, 8, 9],
    'name': ['Meir', 'Michael', 'Addilyn', 'Juan', 'Kannon'],
    'salary': [3000, 3800, 7400, 6100, 7700]
}

df = pd.DataFrame(data)

In [16]:
def calculate_bonus(data):
    if (data['employee_id'] % 2 == 1) and (not data['name'].startswith('M')):
        data['bonus'] = data['salary'] * 1;
    else:
        data['bonus'] = data['salary'] * 0;
    return data.drop(['name', 'salary'])

def calculate_special_bonus(employees: pd.DataFrame) -> pd.DataFrame:
    df = employees.apply(calculate_bonus, axis=1)
    return df.sort_values(by=['employee_id'])

calculate_special_bonus(df)

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

1667. Fix Names in a Table

In [17]:
data = {
    'user_id': [1, 2],
    'name': ['aLice', 'bOB']
}

df = pd.DataFrame(data)

In [18]:
def fix_names(users: pd.DataFrame) -> pd.DataFrame:
    users['name'] = users['name'].str.capitalize()
    return users.sort_values('user_id')

fix_names(df)

   user_id   name
0        1  Alice
1        2    Bob

1517. Find Users With Valid E-Mails

In [19]:
data = {
    'user_id': [1, 2, 3, 4, 5, 6, 7],
    'name': ['Winston', 'Jonathan', 'Annabelle', 'Sally', 'Marwan', 'David', 'Shapiro'],
    'mail': ['winston@leetcode.com', 'jonathanisgreat', 'bella-@leetcode.com',
             'sally.come@leetcode.com', 'quarz#2020@leetcode.com',
             'david69@gmail.com', '.shapo@leetcode.com']
}

df = pd.DataFrame(data)

In [20]:
def is_valid_email(email):
    if not isinstance(email, str):
        return False
    
    split_at = email.split('@')

    if(len(split_at) != 2):
        return False
    
    front, back = split_at
    if not front[0].isalpha():
        return False
    
    valid_character = set('abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789-._')
    for char in front:
        if char not in valid_character:
            return False
        
    if back != "leetcode.com":
        return False
    
    return True



def valid_emails(users: pd.DataFrame) -> pd.DataFrame:
    users = users[users['mail'].apply(is_valid_email) == True]
    return users
    

valid_emails(df)

   user_id       name                     mail
0        1    Winston     winston@leetcode.com
2        3  Annabelle      bella-@leetcode.com
3        4      Sally  sally.come@leetcode.com

1527. Patients With a Condition

In [21]:
data = {
    'patient_id': [1, 2, 3, 4, 5],
    'patient_name': ['Daniel', 'Alice', 'Bob', 'George', 'Alain'],
    'conditions': ['YFEV COUGH', '', 'DIAB100 MYOP', 'ACNE DIAB100', 'DIAB201']
}


df = pd.DataFrame(data)

In [22]:
def is_patient(data):
    if 'SADIAB1' in data:
        return False
    elif 'DIAB1' in data:
        return True
    else:
        return False

def find_patients(patients: pd.DataFrame) -> pd.DataFrame:
    patients = patients[patients['conditions'].apply(is_patient) == True]
    return patients

find_patients(df)

   patient_id patient_name    conditions
2           3          Bob  DIAB100 MYOP
3           4       George  ACNE DIAB100

177. Nth Highest Salary

In [23]:
data = {
    'id': [1, 2, 3],
    'salary': [100, 200, 300]
}

df = pd.DataFrame(data)

In [24]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    employee_salary = employee.sort_values(by='salary', ascending=False).drop_duplicates()

    if N <= len(employee_salary):
        return employee_salary.iloc[N-1]['salary']
    else:
        return None
    
nth_highest_salary(df, 2)

200

176. Second Highest Salary

In [25]:
data = {
    'id': [1, 2, 3],
    'salary': [100, 200, 300]
}

df = pd.DataFrame(data)

In [26]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    employee_sorted = employee.sort_values(by='salary', ascending=False).drop_duplicates(subset='salary')

    if len(employee_sorted) < 2:
        return pd.DataFrame({'SecondHighestSalary': [None]})


    return pd.DataFrame({'SecondHighestSalary': [employee_sorted.iloc[1]['salary']]})
    
second_highest_salary(df)

   SecondHighestSalary
0                  200

184. Department Highest Salary

In [27]:
# Create a DataFrame for the Employee table
employee_data = {
    'id': [1, 2, 3, 4, 5],
    'name': ['Joe', 'Jim', 'Henry', 'Sam', 'Max'],
    'salary': [70000, 90000, 80000, 60000, 90000],
    'departmentId': [1, 1, 2, 2, 1]
}

employee_df = pd.DataFrame(employee_data)

# Create a DataFrame for the Department table
department_data = {
    'id': [1, 2],
    'name': ['IT', 'Sales']
}

department_df = pd.DataFrame(department_data)

In [28]:
def department_highest_salary(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:
    combined_df = employee.merge(department, how='left', left_on='departmentId', right_on='id')
    combined_df = combined_df.rename(columns={'name_y': 'Department', 'name_x': 'Employee', 'salary': 'Salary'})
    combined_df = combined_df[['Department', 'Employee', 'Salary']]
    index = combined_df.groupby('Department')['Salary'].transform(max) == combined_df['Salary']
    return combined_df.loc[index]

department_highest_salary(employee_df, department_df)

  Department Employee  Salary
1         IT      Jim   90000
2      Sales    Henry   80000
4         IT      Max   90000

178. Rank Scores

In [29]:
data = {
    'id': [1, 2, 3, 4, 5, 6],
    'score': [3.50, 3.65, 4.00, 3.85, 4.00, 3.65]
}

scores_df = pd.DataFrame(data)

In [30]:
def order_scores(scores: pd.DataFrame) -> pd.DataFrame:
    scores['rank'] = scores['score'].rank(ascending=False, method='dense').astype(int)
    scores = scores[['score', 'rank']]
    return scores.sort_values(by='score', ascending=False)   

order_scores(scores_df)

   score  rank
2   4.00     1
4   4.00     1
3   3.85     2
1   3.65     3
5   3.65     3
0   3.50     4

196. Delete Duplicate Emails

In [31]:
data = {
    'id': [1, 2, 3],
    'email': ['john@example.com', 'bob@example.com', 'john@example.com']
}

df = pd.DataFrame(data)

In [32]:
def delete_duplicate_emails(person: pd.DataFrame) -> None:
    person.sort_values(by=['id'], inplace=True)
    person.drop_duplicates(subset=['email'], keep='first', inplace=True)


delete_duplicate_emails(df)
print(df)

   id             email
0   1  john@example.com
1   2   bob@example.com

1795. Rearrange Products Table

In [33]:
data = {
    'product_id': [0, 1],
    'store1': [95, 70],
    'store2': [100, None],  # Represent missing value as None
    'store3': [105, 80]
}

products_df = pd.DataFrame(data)

In [34]:
def rearrange_products_table(products: pd.DataFrame) -> pd.DataFrame:
    result = pd.melt(products, id_vars=['product_id'], var_name='store', value_name='price')
    result = result.dropna(subset=['price'])
    return result

print(rearrange_products_table(products_df))

   product_id   store  price
0           0  store1   95.0
1           1  store1   70.0
2           0  store2  100.0
4           0  store3  105.0
5           1  store3   80.0

2082. The Number of Rich Customers

In [35]:
# Create a DataFrame for the Store table
data = {
    'bill_id': [6, 8, 4, 11, 13],
    'customer_id': [1, 1, 2, 3, 3],
    'amount': [549, 834, 394, 657, 257]
}

store_df = pd.DataFrame(data)

In [36]:
def count_rich_customers(store: pd.DataFrame) -> pd.DataFrame:
    customers_with_high_bills = store.groupby('customer_id')['amount'].apply(lambda x: (x > 500).any())
    return pd.DataFrame({'rich_count': [customers_with_high_bills.sum()]})

count_rich_customers(store_df)

   rich_count
0           2

1173. Immediate Food Delivery I

In [37]:
data = {
    'delivery_id': [1, 2, 3, 4, 5, 6],
    'customer_id': [1, 5, 1, 3, 4, 2],
    'order_date': ['2019-08-01', '2019-08-02', '2019-08-11', '2019-08-24', '2019-08-21', '2019-08-11'],
    'customer_pref_delivery_date': ['2019-08-02', '2019-08-02', '2019-08-11', '2019-08-26', '2019-08-22', '2019-08-13']
}

delivery_df = pd.DataFrame(data)

# Convert date columns to datetime objects
delivery_df['order_date'] = pd.to_datetime(delivery_df['order_date'])
delivery_df['customer_pref_delivery_date'] = pd.to_datetime(delivery_df['customer_pref_delivery_date'])

delivery_df

   delivery_id  customer_id order_date customer_pref_delivery_date
0            1            1 2019-08-01                  2019-08-02
1            2            5 2019-08-02                  2019-08-02
2            3            1 2019-08-11                  2019-08-11
3            4            3 2019-08-24                  2019-08-26
4            5            4 2019-08-21                  2019-08-22
5            6            2 2019-08-11                  2019-08-13

In [38]:
def food_delivery(delivery: pd.DataFrame) -> pd.DataFrame:
    immediate = (delivery['order_date'] == delivery['customer_pref_delivery_date'])
    precentage = immediate.sum() / len(delivery)
    return pd.DataFrame({'immediate_percentage': [round(precentage*100, 2)]})

food_delivery(delivery_df)

   immediate_percentage
0                 33.33

1907. Count Salary Categories

In [39]:
# Create a DataFrame for the Accounts table
data = {
    'account_id': [3, 2, 8, 6],
    'income': [108939, 12747, 87709, 91796]
}

accounts_df = pd.DataFrame(data)

In [40]:
def count_salary_categories(accounts: pd.DataFrame) -> pd.DataFrame:
    salary = {
        'Low Salary': (accounts['income'] < 20000),
        'Average Salary': ((accounts['income'] >= 20000) & (accounts['income'] <= 50000)),
        'High Salary': (accounts['income'] > 50000)
    }

    income_account = {}
    for i, j in salary.items():
        income_account[i] = j.sum()

    result = pd.DataFrame(list(income_account.items()), columns=['category', 'accounts_count'])
    return result

count_salary_categories(accounts_df)

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3

1741. Find Total Time Spent by Each Employee

In [41]:
data = {
    'emp_id': [1, 1, 1, 2, 2],
    'event_day': ['2020-11-28', '2020-11-28', '2020-12-03', '2020-11-28', '2020-12-09'],
    'in_time': [4, 55, 1, 3, 47],
    'out_time': [32, 200, 42, 33, 74]
}

# Create a Pandas DataFrame
employees_df = pd.DataFrame(data)

In [42]:
def total_time(employees: pd.DataFrame) -> pd.DataFrame:
    employees['event_day'] = pd.to_datetime(employees['event_day'])
    employees['total_time'] = (employees['out_time'] - employees['in_time']).clip(lower=0)
    result = employees.groupby(['emp_id', 'event_day'])['total_time'].sum().reset_index().rename(columns={'event_day': 'day'})
    return result[['day', 'emp_id', 'total_time']]

total_time(employees_df)

         day  emp_id  total_time
0 2020-11-28       1         173
1 2020-12-03       1          41
2 2020-11-28       2          30
3 2020-12-09       2          27

511. Game Play Analysis I

In [43]:
data = {
    'player_id': [1, 1, 2, 3, 3],
    'device_id': [2, 2, 3, 1, 4],
    'event_date': ['2016-03-01', '2016-05-02', '2017-06-25', '2016-03-02', '2018-07-03'],
    'games_played': [5, 6, 1, 0, 5]
}

activity_df = pd.DataFrame(data)
activity_df['event_date'] = pd.to_datetime(activity_df['event_date'])

In [44]:
def game_analysis(activity: pd.DataFrame) -> pd.DataFrame:
    login_date = activity.groupby('player_id')['event_date'].min().reset_index()
    login_date.columns = ['player_id', 'first_login']
    return login_date

game_analysis(activity_df)

   player_id first_login
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02

2356. Number of Unique Subjects Taught by Each Teacher

In [45]:
data = {
    'teacher_id': [1, 1, 1, 2, 2, 2, 2],
    'subject_id': [2, 2, 3, 1, 2, 3, 4],
    'dept_id': [3, 4, 3, 1, 1, 1, 1]
}

# Create a Pandas DataFrame
teacher_df = pd.DataFrame(data)

In [46]:
def count_unique_subjects(teacher: pd.DataFrame) -> pd.DataFrame:
    unique_subject_for_teacher = teacher.groupby('teacher_id')['subject_id'].nunique().reset_index()
    unique_subject_for_teacher.columns = ['teacher_id', 'cnt']
    return unique_subject_for_teacher

count_unique_subjects(teacher_df)

   teacher_id  cnt
0           1    2
1           2    4

596. Classes More Than 5 Students

In [47]:
data = {
    'student': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'],
    'class': ['Math', 'English', 'Math', 'Biology', 'Math', 'Computer', 'Math', 'Math', 'Math']
}

# Create a Pandas DataFrame
courses_df = pd.DataFrame(data)

In [48]:
def find_classes(courses: pd.DataFrame) -> pd.DataFrame:
    class_count = courses.groupby('class')['student'].count().reset_index()
    most_class = class_count[class_count['student'] >= 5]
    most_class.drop('student', axis=1, inplace=True)
    return most_class

find_classes(courses_df)

C:\Users\USER\AppData\Local\Temp\ipykernel_14508\2130058373.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  most_class.drop('student', axis=1, inplace=True)

  class
3  Math

586. Customer Placing the Largest Number of Orders

In [49]:
data = {
    'order_number': [1, 2, 3, 4],
    'customer_number': [1, 2, 3, 3]
}

# Create a Pandas DataFrame
orders_df = pd.DataFrame(data)

In [50]:
def largest_orders(orders: pd.DataFrame) -> pd.DataFrame:
    if(orders.empty):
        return pd.DataFrame({'customer_number': []})
    most_orders = orders.groupby('customer_number').size().idxmax()
    # count = orders.groupby('customer_number').size().reset_index(name='order_count')
    # sorted = count.sort_values(by='order_count', ascending=False)
    # most_orders = sorted.iloc[0]['customer_number']
    return pd.DataFrame({'customer_number': [most_orders]})

largest_orders(orders_df)

   customer_number
0                3

1484. Group Sold Products By The Date

In [51]:
data = {
    'sell_date': ['2020-05-30', '2020-06-01', '2020-06-02', '2020-05-30', '2020-06-01', '2020-06-02', '2020-05-30'],
    'product': ['Headphone', 'Pencil', 'Mask', 'Basketball', 'Bible', 'Mask', 'T-Shirt']
}

# Create a Pandas DataFrame
activities_df = pd.DataFrame(data)

In [52]:
def categorize_products(activities: pd.DataFrame) -> pd.DataFrame:
    result = activities.groupby('sell_date')['product'].unique().apply(sorted).reset_index()
    result['product_count'] = result['product'].apply(len)
    result = result.rename(columns={'product': 'products', 'product_count': 'num_sold'})
    result = result[['sell_date', 'num_sold', 'products']]
    result['products'] = result['products'].apply(','.join)
    return result

categorize_products(activities_df)

    sell_date  num_sold                      products
0  2020-05-30         3  Basketball,Headphone,T-Shirt
1  2020-06-01         2                  Bible,Pencil
2  2020-06-02         1                          Mask

1693. Daily Leads and Partners

In [53]:
data = {
    'date_id': ['2020-12-8', '2020-12-8', '2020-12-8', '2020-12-7', '2020-12-7', '2020-12-8', '2020-12-8', '2020-12-7', '2020-12-7', '2020-12-7'],
    'make_name': ['toyota', 'toyota', 'toyota', 'toyota', 'toyota', 'honda', 'honda', 'honda', 'honda', 'honda'],
    'lead_id': [0, 1, 1, 0, 0, 1, 2, 0, 1, 2],
    'partner_id': [1, 0, 2, 2, 1, 2, 1, 1, 2, 1]
}

# Create a Pandas DataFrame
daily_sales_df = pd.DataFrame(data)

In [56]:
def daily_leads_and_partners(daily_sales: pd.DataFrame) -> pd.DataFrame:
    result = daily_sales.groupby(['date_id', 'make_name']).agg({
        'lead_id': 'nunique',
        'partner_id': 'nunique'
    }).reset_index()
    result.rename(columns={'lead_id': 'unique_leads', 'partner_id': 'unique_partners'}, inplace=True)
    return result

daily_leads_and_partners(daily_sales_df)

     date_id make_name  unique_leads  unique_partners
0  2020-12-7     honda             3                2
1  2020-12-7    toyota             1                2
2  2020-12-8     honda             2                2
3  2020-12-8    toyota             2                3

1050. Actors and Directors Who Cooperated At Least Three Times

In [57]:
data = {
    'actor_id': [1, 1, 1, 1, 1, 2, 2],
    'director_id': [1, 1, 1, 2, 2, 1, 1],
    'timestamp': [0, 1, 2, 3, 4, 5, 6]
}

# Create a Pandas DataFrame
actor_director_df = pd.DataFrame(data)

In [58]:
def actors_and_directors(actor_director: pd.DataFrame) -> pd.DataFrame:
    count = actor_director.groupby(['actor_id', 'director_id']).size().reset_index(name='count')
    choosen_result = count[count['count'] >= 3]
    return choosen_result.drop(columns=['count'])

actors_and_directors(actor_director_df)

   actor_id  director_id
0         1            1

1378. Replace Employee ID With The Unique Identifier

In [59]:
# Create a dictionary for the Employees table
employees_data = {
    'id': [1, 7, 11, 90, 3],
    'name': ['Alice', 'Bob', 'Meir', 'Winston', 'Jonathan']
}

# Create a Pandas DataFrame for the Employees table
employees_df = pd.DataFrame(employees_data)

# Create a dictionary for the EmployeeUNI table
employee_uni_data = {
    'id': [3, 11, 90],
    'unique_id': [1, 2, 3]
}

# Create a Pandas DataFrame for the EmployeeUNI table
employee_uni_df = pd.DataFrame(employee_uni_data)

In [62]:
def replace_employee_id(employees: pd.DataFrame, employee_uni: pd.DataFrame) -> pd.DataFrame:
    result = employees.merge(employee_uni, how='left', on='id').astype({'unique_id': 'Int64'})
    result = result[['unique_id', 'name']]
    return result

replace_employee_id(employees_df, employee_uni_df)

   unique_id      name
0       <NA>     Alice
1       <NA>       Bob
2          2      Meir
3          3   Winston
4          1  Jonathan

1280. Students and Examinations

In [78]:
students_data = {
    'student_id': [1, 2, 13, 6],
    'student_name': ['Alice', 'Bob', 'John', 'Alex']
}

subjects_data = {
    'subject_name': ['Math', 'Physics', 'Programming']
}

examinations_data = {
    'student_id': [1, 1, 1, 2, 1, 1, 13, 13, 13, 2, 1],
    'subject_name': ['Math', 'Physics', 'Programming', 'Programming', 'Physics', 'Math', 'Math', 'Programming', 'Physics', 'Math', 'Math']
}

students_df = pd.DataFrame(students_data)
subjects_df = pd.DataFrame(subjects_data)
examinations_df = pd.DataFrame(examinations_data)

In [101]:
from itertools import product

def students_and_examinations(students: pd.DataFrame, subjects: pd.DataFrame, examinations: pd.DataFrame) -> pd.DataFrame:
    student_and_subject = pd.merge(students, subjects, how='cross').sort_values(by=['student_id', 'subject_name'])
    exam = examinations.groupby(['student_id', 'subject_name']).agg(attended_exams=('subject_name', 'count')).reset_index()
    student_exam = pd.merge(student_and_subject, exam, how='left', on=['student_id', 'subject_name']).fillna(0).astype({'attended_exams': 'int32'})

    return student_exam[['student_id', 'student_name', 'subject_name', 'attended_exams']]

students_and_examinations(students_df, subjects_df, examinations_df)

    student_id student_name subject_name  attended_exams
0            1        Alice         Math               3
1            1        Alice      Physics               2
2            1        Alice  Programming               1
3            2          Bob         Math               1
4            2          Bob      Physics               0
5            2          Bob  Programming               1
6            6         Alex         Math               0
7            6         Alex      Physics               0
8            6         Alex  Programming               0
9           13         John         Math               1
10          13         John      Physics               1
11          13         John  Programming               1

570. Managers with at Least 5 Direct Reports

In [119]:
data = {
    'id': [101, 102, 103, 104, 105, 106],
    'name': ['John', 'Dan', 'James', 'Amy', 'Anne', 'Ron'],
    'department': ['A', 'A', 'A', 'A', 'A', 'B'],
    'managerId': [None, 101, 101, 101, 101, 101]
}

dfa = pd.DataFrame(data)

In [121]:
def find_managers(employee: pd.DataFrame) -> pd.DataFrame:
    direct = employee.groupby('managerId', as_index=False).agg('count')
    return employee[employee['id'].isin(direct[direct['id'] >= 5]['managerId'].values)][['name']]

find_managers(dfa)

   name
0  John

607. Sales Person

In [135]:
# SalesPerson table
salesperson_data = {
    'sales_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Amy', 'Mark', 'Pam', 'Alex'],
    'salary': [100000, 12000, 65000, 25000, 5000],
    'commission_rate': [6, 5, 12, 25, 10],
    'hire_date': ['4/1/2006', '5/1/2010', '12/25/2008', '1/1/2005', '2/3/2007']
}

salesperson_df = pd.DataFrame(salesperson_data)

# Company table
company_data = {
    'com_id': [1, 2, 3, 4],
    'name': ['RED', 'ORANGE', 'YELLOW', 'GREEN'],
    'city': ['Boston', 'New York', 'Boston', 'Austin']
}

company_df = pd.DataFrame(company_data)

# Orders table
orders_data = {
    'order_id': [1, 2, 3, 4],
    'order_date': ['1/1/2014', '2/1/2014', '3/1/2014', '4/1/2014'],
    'com_id': [3, 4, 1, 1],
    'sales_id': [4, 5, 1, 4],
    'amount': [10000, 5000, 50000, 25000]
}

orders_df = pd.DataFrame(orders_data)

In [144]:
def sales_person(sales_person: pd.DataFrame, company: pd.DataFrame, orders: pd.DataFrame) -> pd.DataFrame:
    sales_and_orders = pd.merge(sales_person, orders, how='left', left_on='sales_id', right_on='sales_id')
    order_and_company = pd.merge(sales_and_orders, company, how='left', left_on='com_id', right_on='com_id')
    order_and_company.rename(columns={'name_x': 'name'}, inplace=True)
    red_name = order_and_company[order_and_company['name_y'] == 'RED']
    not_red_name = order_and_company[order_and_company['name_y'] != 'RED']
    unique_sales_id = not_red_name[~not_red_name['name'].isin(red_name['name'])]['name'].unique()
    sales_name = order_and_company[order_and_company['name'].isin(unique_sales_id)]
    sales_name = sales_name[['name']].drop_duplicates()
    return sales_name

sales_person(salesperson_df, company_df, orders_df)

   name
1   Amy
2  Mark
5  Alex